<template>
    <div class="resut-con">
        <div class="indus-title clearfix">
            所属行业：{{industry_name}}
           <!-- <a href="javascript:;" class="indus-title-a">更多行业观点></a> -->
        </div>
        <div class="indus-news clearfix">
          <div class="indus-nl">
            <span class="">{{industryAll.source}} {{industryAll.createDate}}</span>
            <ul>
              <li><em></em>{{industryAll.title}}}</li>
              <!--<li><em></em>阿里调整组织体系，亚马逊推出服务器芯片</li>-->
            </ul>
          </div>
          <div class="indus-nr">
            <p>情感分数：</p>
            <p>{{industryAll.grade}}</p>
          </div>
        </div>
        <div class="indus-chart-title">
          <p>{{industryAll.point}}</p>
            <span>{{industry_name}}行业指数及预测值</span>
            <div id="chartLine" style="width:100%;height:180px;">
                <!--折线图-->
            </div>

        </div>
    </div>
</template>

<script>
// import echarts from 'echarts'
import echarts from 'echarts/lib/echarts'

import 'echarts/lib/chart/line'
import 'echarts/lib/component/tooltip'
import 'echarts/lib/component/title'
import index from "../../router";

const industry = [{
  "code": "CI005028.WI",
  "source": "首创证券",
  "createDate": "20181211",
  "title": "文化传播行业周报:腾讯音乐IPO在即,数字音乐迎产业大发展",
  "point": "但相对2016、2017年来说,2018年传媒板块的整体行情还是显现了投资活力修复的迹象;此外,行业变革中脱颖而出的佼佼者也能够为板块带来新的活力    我们认为,2019年上半年,传媒板块将出现结构性反弹的机会,建议投资者秉承价值投资的理念,布局两类传媒板块标的;    一是具备安全边际和稳健成长性的低估值龙头,受益板块整体估值修复的利好;推荐关注;推荐关注;推荐关注;推荐关注",
  "grade": "90.52"
},
  {
    "code": "CI005027.WI",
    "source": "信达证券",
    "createDate": "20181210",
    "title": "计算机行业周报:电子病历分级标准明确,医疗信息化再获政策推动",
    "point": "因此,长期而言医疗信息化市场发展值得期待;短期内,由于相关政策的持续推进以及以电子病历为核心的对医院信息化建设的具体要求被提出,将在未来两年带来医院信息化需求的明显提升",
    "grade": "94.82"
  },
  {
    "code": "CI005026.WI",
    "source": "海通证券",
    "createDate": "20181212",
    "title": "海通通信行业一周谈:5G频谱分配尘埃落地,5G投资逐渐拉开帷幕",
    "point": "就5G的电信设备产业链投资策略而言,2018年下半年~2019年上半年可定义为主题投资阶段,催化剂侧重在关注频谱分配方案、2019年国内5G投资规模落实、商用牌照发放、主流电信运营商5G规划宣示等行业性事件,体现在估值震荡提升推动5G设备产业链上市公司市值提升;    继续建议重点关注5G电信设备侧产业链;    我们预计北美云计算巨头资本开支展望保持增长,但幅度可能大幅放缓",
    "grade": "50.22"
  },
  {
    "code": "CI005025.WI",
    "source": "国金证券",
    "createDate": "20181213",
    "title": "半导体行业研究周报:比亚迪引领汽车“芯”时代,屏下指纹面面观",
    "point": "核心观点    此次国内新能源汽车龙头比亚迪在车用IGBT芯片领域的突破打破了欧洲美国日本对于车用领域IGBT长期处于垄断的局面,有望加速国产IGBT替代进口产品的进程;其中比亚迪在车规级IGBT产业链中布局最早,属于优先受益的IDM巨头,另外国内IGBT晶圆代工厂上海先进半导体和华虹半导体均有望受益;而超声方案的优点在于其穿透性更强,能够进行深层的皮下指纹识别且能够辨别活体,因而方案的安全性更高;行业竞争加剧导致ASP下降",
    "grade": "62.93"
  },
  {
    "code": "CI005024.WI",
    "source": "平安证券",
    "createDate": "20181209",
    "title": "交通运输行业周报:铁总更名获准,大秦参与蒙华铁路资本金募集",
    "point": "在交运主要子行业中,按市盈率(ttm)高低依次为航运、航空运输、机场、公交、物流、交通运输、港口、铁路运输、高速公路;机场板块经营稳健,现金流好,同时非航业务打开成长空间,建议关注上海机场、深圳机场;我们认为部分快递企业会取得远高于行业增速的业绩成长,推荐成本管控能力强的韵达股份,布局航空、打造差异化的圆通速递,理顺经营、边际改善明显的申通快递,建议关注向综合物流服务商转变的顺丰控股;快递行业的发展很大程度依赖于电商,如果电商增速放缓,将会带来快递行业增速下降",
    "grade": "51.41"
  },
  {
    "code": "CI005023.WI",
    "source": "中银国际证券",
    "createDate": "20181214",
    "title": "房地产行业11月报:新开工及施工支撑投资,销售持续走弱",
    "point": "土地投资加速下滑,伴随7月以来土地市场供需两弱,我们预计未来多月土地购置费将大幅下行;土地投资加速下滑,伴随7月以来土地市场供需两弱,我们预计未来多月土地购置费将大幅下行;土地投资加速下滑,伴随7月以来土地市场供需两弱,我们预计未来多月土地购置费将大幅下行;土地投资加速下滑,伴随7月以来土地市场供需两弱,我们预计未来多月土地购置费将大幅下行;我们重申板块强于大市的评级,推荐组合;建议关注高成长性房企;我们预计一二线在供给改善、去化较好的情况下,成交将持续改善;展望2019,我们认为销售将持续处于下行通道,预计全年销售面积同比下降5-10%",
    "grade": "73.77"
  },
  {
    "code": "CI005022.WI",
    "source": "东兴证券",
    "createDate": "20181211",
    "title": "证券行业周报:密切关注风险偏好抬升进程中小券商投资价值将重回视野",
    "point": "密切关注风险偏好抬升进程中小券商投资价值将重回视野;    投资策略    目前证券板块的贝塔转换上行扩张周期仍未完成,受到市场风险偏好抬升不足的压制;我们维持券商板块行情核心逻辑的判断;从以往数据来看,当基本面预期修复后风险偏好提升有一定滞后性;目前基本面舆情已经有超过一个月的高涨期,而风险偏好并未上涨;前期系统重要性金融机构的新规将使得龙头券商的集中度逻辑呈现一定的边际变化",
    "grade": "40.3"
  },
  {
    "code": "CI005021.WI",
    "source": "中银国际证券",
    "createDate": "20181217",
    "title": "银行行业周报:表外融资压降趋缓,关注货币政策传导效果",
    "point": "目前银行板块估值对应18年0.83xPB,短期受市场对行业资产质量的担忧影响,向上弹性有限;个股方面,我们推荐基本面边际改善的上海银行和光大银行,继续看好大行和招商银行",
    "grade": "99.85"
  },
  {
    "code": "CI005020.WI",
    "source": "太平洋",
    "createDate": "20181202",
    "title": "农林牧渔行业周报(第48周):鸡价高位震荡,猪价普遍上涨",
    "point": "我们对后市农业板块投资观点如下;近年来我国已经确诊为人感染H5N6禽流感的病例很少,但死亡率较高,建议重点关注疫情发展;我们认为,白鸡产业链价格高位回调幅度将比较有限;我们认为,如逐渐放开点对点调肉,将有利于相关产区猪价回升,相关销区因供给增加猪价或有回调;建议现阶段进场配置,主要推荐标的是温氏股份、唐人神、正邦科技和天邦股份",
    "grade": "87.25"
  },
  {
    "code": "CI005019.WI",
    "source": "中银国际证券",
    "createDate": "20181217",
    "title": "食品饮料行业周报:19年竞争有望趋缓,乳品龙头估值具有吸引力",
    "point": "19年竞争有望趋缓,乳品龙头估值具有吸引力;19年蒙牛提升经营利润率与维持净利较快增长的难度边际提升;    关注19年有机会超预期的品种;贵州茅台、山西汾酒、舍得酒业;    风险提示    经济下滑对白酒行业的影响超预期",
    "grade": "42.95"
  },
  {
    "code": "CI005018.WI",
    "source": "山西证券",
    "createDate": "20181215",
    "title": "医药行业周报:全国辅助用药目录将制订,医药板块继续承压",
    "point": "全国辅助用药目录将制订,医药板块继续承压;    上周提到带量采购的推进将对仿制药行业带来非常大的影响,虽然药价大幅下行,但部分药企通过以量换价仍能维持其市场份额",
    "grade": "77.26"
  },
  {
    "code": "CI005017.WI",
    "source": "长城证券",
    "createDate": "20181203",
    "title": "纺织服装行业12月第一周周报:贸易摩擦压力缓解,龙头纺企优势凸显",
    "point": "    贸易摩擦影响相对有限,9-10月行业出口增速仍较快;从2018年9-10月份出口端表现看,贸易摩擦影响相对有限,出口金额仍保持快速增长;    谈判仍存不确定性因素,看好风险转嫁能力较强的龙头纺企;但是,无论未来谈判走向如何,提前布局海外产能的龙头纺企不仅具备成本优势,而且可享受更为优惠的税率,风险转嫁能力以及盈利确定性更强,继续看好百隆东方等持续优化产能布局的龙头纺企",
    "grade": "99.27"
  },
  {
    "code": "CI005015.WI",
    "source": "国海证券",
    "createDate": "20181210",
    "title": "休闲服务行业周报:复兴旅文IPO定价15.6港元,携程进军滑雪市场",
    "point": "但Club Med和三亚亚特兰蒂斯及Thomas cook均是行业内具有标杆意义的经营业态,且处于行业领头低位,因此其未来发展态势非常值得关注;    看好行业长期发展趋势;未来随着需求提升、交通条件不断完善、产品愈发丰富,行业将持续稳健发展,维持行业“推荐”评级;子板块方面,我们相对看好政策支持力度较大的免税子板块,此外关注酒店、旅行社和景区等龙头个股;2)宏观经济低迷影响需求",
    "grade": "59.45"
  },
  {
    "code": "CI005014.WI",
    "source": "中泰证券",
    "createDate": "20181202",
    "title": "商业贸易行业周报:社区社群的崛起或将带来电商下一个新风口",
    "point": "公司家电零售已形成宽阔护城河,全渠道多业态精耕智慧零售生态圈,开启规模发展新篇章,维持“买入”评级;苏宁经营基本面向好,市场份额有望进一步提升,当前处于历史估值底部,存在较大的估值修复空间;(1)线下围绕“一大、两小、多专”的产品业态推进网络布局,全方位把握各层级市场的消费机会;建议重点关注永辉超市、步步高、中百集团等",
    "grade": "75.64"
  },
  {
    "code": "CI005013.WI",
    "source": "开源证券",
    "createDate": "20181217",
    "title": "新能源汽车行业周报:新能源汽车年产销累计突破100万辆",
    "point": "长远来看,国家支持新能源汽车行业持续健康发展的战略长期不变,传统燃油汽车逐渐被取代是大势所趋,这将长期利好新能源汽车行业;    随着传统燃油车的扩张受阻,加上双积分政策压力,预计未来会有更多传统车企加入新能源汽车领域,新能源整车行业的竞争也将更为激烈,这也是行业的必由之路;我们认为在此背景下,新能源汽车产业链龙头型企业将凸显竞争潜力;(2)拥有规模优势、技术门槛高并进入新能源乘用车供应链的标的;长期关注投资标的",
    "grade": "81.9"
  },
  {
    "code": "CI005012.WI",
    "source": "海通证券",
    "createDate": "20181212",
    "title": "军工行业周报(第45期):关注具备边际变化的民参军标的和高景气的中游细分领域龙头",
    "point": "关注具备边际变化的民参军标的和高景气的中游细分领域龙头;我们认为,当前应当关注具备边际变化的民参军标的,不仅是内生业绩端的改善,还应包含回购、激励、外延并购等方向的变化;此外,中游细分领域有望在利润表中体现较快增长的龙头标的亦需重视",
    "grade": "21.7"
  },
  {
    "code": "CI005011.WI",
    "source": "开源证券",
    "createDate": "20181210",
    "title": "电气设备与新能源行业周报2018年第49周:火电依然紧平衡,两部委提“清洁能源消纳行动计划”",
    "point": "2018我国火电机组设备利用率提高煤价继续造成压力;从火电设备利用率上看,与去年同期相比,全国除西北地区外提升均较为明显,但是煤价上涨等因素遏制了这一利好因素;目前来看,今年初我们就预计的2018年的火电迎将迎来业绩改善性机会,如今火电设备利用率的提高进一步利于火电的业绩在逐步的恢复,不过受制于煤价依然在高位运行,火电在外表现依然处于紧平衡状态;火电在未来有望获得更多稳定煤价的的支撑,未来在市场动荡期,投资者可适当关注具有防御属性的领先龙头火电企业平台",
    "grade": "69.7"
  },
  {
    "code": "CI005010.WI",
    "source": "新时代证券",
    "createDate": "20181209",
    "title": "2018年机械行业周报12月第1期:铁路投资或将边际改善,OPEC减产利好能源设备",
    "point": "铁路投资或将边际改善,OPEC减产利好能源设备;联赢激光启动IPO表明其对行业未来发展有信心,侧面印证国内激光产业仍维持较高景气度;目前国内高功率激光器国产化率处于提升阶段,高功率激光器和激光装备的技术升级及国产化率提升将促进激光装备渗透率提高,促进行业空间增长,国产激光行业龙头企业有望迎来发展机遇;细分领域高空作业平台景气度延续,优质企业具备较大成长潜力;预计国内页岩油气开采力度持续加大,2019-2020年国内压裂设备需求增长,优质压裂油服和设备龙头将受益",
    "grade": "96.73"
  },
  {
    "code": "CI005009.WI",
    "source": "国金证券",
    "createDate": "20181202",
    "title": "轻工造纸行业周报:浆价下跌趋势已现,生活纸企业盈利有望改善",
    "point": "而2018年下半年开始,由于经济增速放缓,加之中美贸易战等因素,市场对于文化用纸需求持续下降,纸厂日益减少的纸浆原料需求不足以消化已投放的大量产能,纸浆库存持续增加,未来纸浆价格下跌大势已成;关于定制家居,我们延续上期周报中的观点,下一阶段行业内的竞争很有可能从降价、提升集中度展开;四五线城市存在的巨大渗透空间使得全国产能布局的定制家居企业进一步提升区域市场服务能力;环保严监管加速落后产能出清,环保用材更受市场青睐;原材料降价将利好下游包装企业,而客源稳定的公司则更有机会挺过低迷的市场需求行情",
    "grade": "83.49"
  },
  {
    "code": "CI005008.WI",
    "source": "光大证券",
    "createDate": "20181202",
    "title": "光大证券非金属类建材周报2018年第39期",
    "point": "南方市场需求需求保持稳定成交良好;水泥价格稳中有升,不确定环境下追寻确定 水泥行业高景气延续,进入旺季以来工程赶工需求旺盛,水泥价格持续上涨;10 月底11 月初突发强制性限产叠加熟料和水泥库存低位,沿江熟料价格两次上涨,带动区域水泥价格跳涨,全国水泥均价创历史新高并有望高位维稳;受益于投资拉动,且地产新开工、施工加速,水泥需求增速持续向好,南强北弱格局延续;行业供给端紧约束延续;    持续推荐业绩增长快而低估值的新型建材标的,鲁阳节能陶纤渗透率提升,石化需求迎来放量",
    "grade": "74.81"
  },
  {
    "code": "CI005007.WI",
    "source": "国泰君安",
    "createDate": "20181125",
    "title": "建筑工程第119期周报:基建反弹设计最受益,铁路轨交铁建等央企最强",
    "point": "我们测算国内ENR设计前60营收集中度(全口径)不足8%/勘设口径27%,已上市基建设计公司并购整合/属地化建设叠加头部效应推动集中度提升;    看好建筑行业未来2个季度超额收益,龙头公司30%以上空间;1)看好建筑未来2个季度超额收益;    推荐基建央企/基建设计(战略品种)/民营生态环保/地方路桥;5)地产产业链推荐全筑股份/东易日盛/金螳螂",
    "grade": "30.41"
  },
  {
    "code": "CI005006.WI",
    "source": "新时代证券",
    "createDate": "20181213",
    "title": "化工行业周报:OPEC+将限产原油120万桶日,中长期主线仍选择农药、新材料",
    "point": "经济环境复杂、下游需求疲软,化工周期板块性机会一般,我们围绕确定性机会选择个股,主要选择农药和新材料两条主线,其中选择农药在于行业景气度确定性强,一是全球农药处于景气周期阶段,二是国内农药在环保督查之下竞争格局大大优化,在环保约束下农药门槛提升,过去违规生产的中小企业陆续退出,农药供给将持续偏紧,相关标的草铵膦龙头利尔化学、菊酯和麦草畏龙头扬农化工",
    "grade": "74.26"
  },
  {
    "code": "CI005005.WI",
    "source": "中国银河证券",
    "createDate": "20181203",
    "title": "钢铁行业周报:产业整合优化,钢铁板块仍有反弹空间",
    "point": "虽然“十三五计划”中去产能的任务已经基本完成,但是根据国家统计局统计数据,国内10月份粗钢产量创历史新高,螺纹钢周度产量创了三年来的新高,而且在行业利润依然维持高位的基础上,钢厂的生产积极性依然较高;在钢铁行业中,我们认为之前跌幅较大同时基本面良好的个股,或将成为行业中的反弹急先锋;依照此逻辑,我们相对看好受到环保限产影响较小的南方钢厂和内生增长较强的行业龙头;考虑到具有超强钢、硅钢等高技术产品和合理的战略布局,内生增长强劲且受益于行业集中度提高的宝钢股份(600019.SH)具有一定的长期投资价值",
    "grade": "85.33"
  },
  {
    "code": "CI005004.WI",
    "source": "安信证券",
    "createDate": "20181216",
    "title": "环保及公用事业周报:电镀等五行业自行监测技术指南发布,排污许可制持续落地",
    "point": "排污许可制执行持续落地,有望进一步催化环境监测需求;10月底以来,环保板块迎来多项融资、基建、财政等支持政策利好,前期市场预期有所提振,环保板块迎来估值修复行情;    融资层面,民企债券融资支持工具落地,上市公司股权增发时间间隔和募资用途放宽,后续建议关注银行风险偏好和环保企业信贷融资的改善;    发电量增速下降,煤价走跌,看好电力板块的防御价值;若进口煤限制力度不如预期、火力发电量继续维持低增速,迎峰度冬期间有望迎来旺季不旺的行情,大幅缓解电厂成本压力;    继续看好天然气产业链标的",
    "grade": "87.12"
  },
  {
    "code": "CI005003.WI",
    "source": "华鑫证券",
    "createDate": "20181126",
    "title": "有色金属行业周报:全球经济增速预期下行,有色板块再度走弱",
    "point": "在当前市场条件下,建议关注细分子行业内核心资源标的,我们看好新能源汽车产业高速发展下的机遇,建议积极关注锂、铜品种,耐心等待投资机会;全球经济增速放缓,导致有色金属需求大幅下降",
    "grade": "99.45"
  },
  {
    "code": "CI005002.WI",
    "source": "光大证券",
    "createDate": "20181210",
    "title": "煤炭行业周报:寒潮天气提振日耗,但高库存依旧压制煤价",
    "point": "由于产品价格大幅回落,钢焦企业利润收窄,对焦煤的采购有所放缓,煤企煤炭库存开始回升,本周吕梁部分地区中硫主焦以及配焦煤种价格出现下跌,降幅30-50 元/吨,短期内,下游利润收窄后必然会打压上游焦煤的价格,预计煤价仍有下行的压力,但由于临近年底,煤矿保安全生产,叠加山西查超产、环保限产、进口煤下降等因素影响,空间或有限;炼焦煤本周也出现松动,在钢焦企业利润大幅收窄的背景下, 将加大对焦煤价格的打压力度,焦煤价格也将面临下行压力,但受制于供给约束,下行空间或有限;从估值来看,目前煤炭板块的PB 估值已经回归至历史低位,板块长期的配置价格开始显现,建议关注",
    "grade": "99.88"
  },
  {
    "code": "CI005001.WI",
    "source": "光大证券",
    "createDate": "20181211",
    "title": "石油化工行业大炼化聚酯产业链周报第45期:产业链底部区域已现,期待后续“企稳复苏”",
    "point": "产业链底部区域已现,期待后续“企稳复苏”;上下游利好因素共促PTA价格价差终回暖    由于本周OPEC+达成120万桶/天减产协议,油价应声上涨,上游成本面得到支撑,且下游受中美贸易摩擦缓和等利好因素影响,本周PTA价格价差在经历了近几个月的持续下跌后,终于迎来大幅上涨;故我们认为整个产业链的底部区间已经显现出来,后续将逐渐企稳复苏;本周受暴雪和寒潮影响,物流行业提前发布了停运通知,我们认为在2018年的最后一个月,业内会进入生产、备货的一个高峰阶段,开工率可能也将继续维持85.93%的高位,期待长丝“触底反弹”后的回升;下游纺织类产品的零售额累计同比增速从3季度开始已经出现了下行,10月份的当月同比也大幅下滑;原油价格下跌和维持高位的风险",
    "grade": "88.88"
  }
]
export default {
  name: 'Industry',
  data () {
    return {
      line: [],
      industry_code:localStorage.getItem('industry_code'),
      industry_name: localStorage.getItem('industry_name'),
      industryAll:{},
    }
  },
  mounted () {
    this.chartLine01()
    let _this = this
    if(JSON.stringify(industry).indexOf(_this.industry_code)!= -1){
      industry.map((value,index)=>{
        if(_this.industry_code === value.code){
          _this.industryAll = value
          return
        }
      })
    }else{
        _this.industryAll = industry[7]
    }


    console.log(_this.industryAll)
  },
  methods: {
    chartLine01 () {
      let chartLine = echarts.init(document.getElementById('chartLine'))
      var option = {
        title: '',
        tooltip: {},
        grid: {
          top: '2%',
          left: '6%',
          right: '6%',
          bottom: '12%'
        },
        xAxis: {
          type: 'category',
          boundaryGap: false,
          axisLine: {
            lineStyle: {
              color: '#fff'
            }
          },
          splitLine: {
            show: false
          },
          axisLabel: {
            show: true,
            textStyle: {
              color: '#6B7D97',
              fontSize: '10'
            }
            // interval: 0,
            // rotate: -90
          },
          data: ['201801', '201802', '201803', '201804', '201805']
        },
        yAxis: {
          type: 'value',
          axisLine: {
            lineStyle: {
              color: '#fff'
            }
          },
          axisLabel: {
            show: true,
            textStyle: {
              color: '#6B7D97',
              fontSize: '10'
            }
          },
          splitLine: {
            show: true,
            lineStyle: {
              color: '#fff',
              width: 1
            }
          },
          splitArea: {
            show: true,
            areaStyle: {
              color: '#F6F8FB'
            }
          }
        },
        series: [{
          name: '销量',
          type: 'line',
          symbol: 'none',
          smooth: true,
          showSymbol: false,
          hoverAnimation: false,
          lineStyle: {
            normal: {
              color: '#079EF6',
              width: 1,
              type: 'solid',
              opacity: 1
            }
          },
          itemStyle: {
            normal: {
              color: 'rgba(7,158,246,0)'
            }
          },
          data: [5, 20, 36, 10, 10, 20]
        }]
      }
      chartLine.setOption(option)
    }
  }

}
</script>
<style scoped>
  .resut-con{
    padding:10px 16px;
  }
  .indus-title{
    display: block;
    font-size:16px;
    padding:0px 0px 10px 0px;
  }
  .indus-title-a{
    display: block;
    float: right;
    font-size:14px;
    color:#11089c;
  }
  .indus-news{
    display: flex;
    flex-direction: row;
    justify-content: space-between;
  }
  .indus-nl{
    display: block;
    background: #F6F8FB;
    padding: 10px 14px;
  }
  .indus-nl span{
    display: block;
    font-size:14px;
    padding:4px 0;
  }
  .indus-nl li {
    display: block;
    padding:2px 0;
  }
  .indus-nl em{
    display: inline-block;
    vertical-align: middle;
    width:6px;
    height: 6px;
    background: #777;
    border-radius:100%;
    margin-right:6px;
  }
  .indus-nr{
    background: #F6F8FB;
    width:36%;
    margin-left:2%;
    display:flex;
    font-size:14px;
    justify-content: center;
    align-items: center;
    flex-direction: column;
  }
  .indus-chart-title span{
    display: block;
    font-size: 16px;
    text-align: center;
    padding:10px 0;
  }
  .indus-chart-title p{
    display: block;
    padding:20px 0;
  }
</style>
